app/controllers/foods_controller.rb

    def create
        @food = Food.new(food_params)
        @food.save
---
INSERT INTO "foods" ("title", "image_id", "expiration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def edit
        @food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        food = Food.find(params[:id])
        food.destroy
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 2]]